/*
 Создать массив размерностью `n`,
  где `n` вводится с клавиатуры.

 Заполнить случайными числами в 
 диапазоне `-220 ... 435`.

 Вывести в документ числа, которые состоят
из двух цифр.
*/

A = []; // через блок инициализации
// A.length = 5;

// A = new Array(+prompt('n = ')); // через конструктор
// console.log(A);

for (i = 0; i < A.length; i++) {
    A[i] = Math.floor(Math.random()*656)-220;

    if ((A[i] >= 10 && A[i] <= 99) || (A[i] >= -99 && A[i]<= -10)) {
        // document.write(A[i] + '<br />')
    }

    /*
    -9 .. 9 -> 0.0x
    -99 .. 99 -> 0.xx

    -9 .. 9 / 10 -> 0.x
    -99 .. 99 / 10 -> x.x

    -9 .. 9 / 100 -> 0.0x
    -99 .. 99 / 100 -> 0.xx
    */
    // var base = A[i];
    // var d1 = base / 10;
    // var d2 = d1 / 10;

    // работа с разрядами числа
   if (
       Math.trunc(A[i] / 10) != 0 && 
       Math.trunc(A[i] / 100) == 0
    ) {
     document.write(A[i] + '<br />')
   }

}
// console.log(A);


/*
    Посчитать факториал числа n.
    Посчитать степень числа a^n.
*/

/*

5! = 1 * 2 * 3 * 4 * 5;
n! = 1 * 2 * ... * (n-2) * (n-1) * n;

res = 1;
for(i = 1; i<=n; i++) {
    res *= i;
}

5^3 = 5 * 5 * 5;
a^n = a1 * a2 * ... * (an-1) * (an); 

res = 1;
for(i = 1; i <= n; i++) {
    res *= a;  
}

*/

// a = +prompt('a = ', '5');
// n = +prompt('n = ', '10');

// fact = 1;
// for(i = 1; i <= n; i++) {
//     fact *= i;
// }

// power = 1;
// for(i = 1; i <= n; i++) {
//     power *= a;
// }

// console.log('n! - ' + fact, 'a^n - ' + power, a**n)


// -----------------------------------
/*
    Посчитать в массиве A[n], заполненным случайными числами факториалы каждого значения.
*/

// A = [];
// A.length = 10;
// for (i = 0, k = 1; i < A.length; i++) {
//     A[i] = Math.floor(Math.random()*20);

//     fact = 1;
//     for(j = 1; j <= A[i]; j++) {
//         fact *= j;
//     }

//     console.log(A[i], fact);
// }

// console.log(A);